{
    "uid": 2,
    "elements": [
        {
            "type": "com.galois.besspin.lando.ssl.ast.RawScenarios",
            "uid": 1,
            "name": "CYBERPHYS_SCENARIOS",
            "scenarios": [
                {
                    "id": "TURN_ON",
                    "text": "Demonstrator is powered on; Wait for the admin PC to boot (ADMIN_PC_BOOTED_UP); Wait for the FETT Tool to start, and provision components (COMPONENT_PROVISIONED events); Once all cyberphys components are provisioned (CYBERPHYS_PROVISIONED), the demonstrator can be used.",
                    "comments": [
                        {
                            "text": "Normal"
                        }
                    ]
                },
                {
                    "id": "ON_OFF",
                    "text": "Turn off the demonstrator, retaining no state.",
                    "comments": [
                        {
                            "text": "Normal"
                        }
                    ]
                },
                {
                    "id": "BASELINE_DRIVE",
                    "text": "The demonstator is on and operational (CYBERPHYS_PROVISIONED); Reset BeamNG (BeamNG_RESET), and start driving (BEAMNG_START_DRIVING); The driver drivers around in the simulator, until the fuel tank is empty (BEAMNG_EMPTY_TANK); The driver can use the Infotainment during the whole time, not only during driving.",
                    "comments": [
                        {
                            "text": "Normal"
                        }
                    ]
                },
                {
                    "id": "HACKED_DRIVE",
                    "text": "The scenario starts the same way as BASELINE_DRIVE; except during the drive a hack is executed (HACK_DEPLOYED); The targeted baseline component is succesfully hacked, while the secure version of the component mitigates the hack; The security mode is switched between \"secure\" (SECURITY_MUX_SECURE_INFOTAINMENT, SECURITY_MUX_SECURE_ECU) and baseline by environmental factors outside the driver's direct control.",
                    "comments": [
                        {
                            "text": "Hack"
                        }
                    ]
                },
                {
                    "id": "HACK_ECU_LANE_KEEPING_ASSIST",
                    "text": "Lane Keeping Assist (LKA) feature in ECU SW is disabled, because the car doesn't have the necessary sensors (cameras) installed, but the ECU SW still contains the LKA code, as a result of poor SW engineering practices; When the ECU is hacked (HACK_DEPLOYED), the bit that disables the LKA feature is flipped and the feature is enabled; Because no camera is present and we intentionally don't include additional safety checks, the ECU sends CAN messages commanding the steering wheel to turn; This effectively causes the driver to lose control of the car during simulation; The only way to recover is to activate one of the \"secure\" security modes (SECURITY_MUX_SECURE_INFOTAINMENT, SECURITY_MUX_SECURE_ECU).",
                    "comments": [
                        {
                            "text": "///////////////////////////////////"
                        },
                        {
                            "text": ""
                        },
                        {
                            "text": "Hacks"
                        },
                        {
                            "text": ""
                        },
                        {
                            "text": "Hacks refined based on https://github.com/DARPA-SSITH-Demonstrators/SSITH-CyberPhys/issues/143"
                        },
                        {
                            "text": ""
                        },
                        {
                            "text": "///////////////////////////////////"
                        }
                    ]
                },
                {
                    "id": "HACK_ECU_THROTTLE",
                    "text": "The hacker can overwrite the pedal position that the ECU SW reads from the physical pedals, and instead send either a random value, or set the value to 100%, which will correspond to fully pressed throttle; Pressing the pedals has no effect; The only way to recover is to activate one of the \"secure\" security modes (SECURITY_MUX_SECURE_INFOTAINMENT, SECURITY_MUX_SECURE_ECU).",
                    "comments": [
                    ]
                },
                {
                    "id": "HACK_ECU_BRAKES",
                    "text": "The hacker can overwrite the pedal position that the ECU SW reads from the physical pedals, and instead send either a random value, or set the value to 100%, which will correspond to fully pressed brake; Pressing the pedals has no effect; The only way to recover is to activate one of the \"secure\" security modes (SECURITY_MUX_SECURE_INFOTAINMENT, SECURITY_MUX_SECURE_ECU).",
                    "comments": [
                    ]
                },
                {
                    "id": "HACK_ECU_TRANSMISSION_SHIFTER_POSITION",
                    "text": "This hack overwrites the position of the Transmission Shifter that the ECU SW reads; As a result, the car is put into neutral, the RPM spikes up, and the drag (or a collision) eventually stops the car; The driver can move the Transmission shifter, but it has no effect; The only way to recover is to activate one of the \"secure\" security modes (SECURITY_MUX_SECURE_INFOTAINMENT, SECURITY_MUX_SECURE_ECU).",
                    "comments": [
                    ]
                },
                {
                    "id": "HACK_INFOTAINMENT_POSITION_EXFILTRATION",
                    "text": "The Infotainment system displays the current car position (either as GPS, or as X-Y coordinates); When this hack is deployed (HACK_DEPLOYED), the hacker can see the current car position in the hacker kiosk; This hack targets Baseline Infotainment Server if SECURITY_MUX_BASELINE or SECURITY_MUX_SECURE_ECU, and Secure Infotainment Server if SECURITY_MUX_SECURE_INFOTAINMENT; A variant of this hack is to show some other car data that is visible on the CAN bus (such as wheel speed, oil and water temperatures, etc.), a secret key stored in the Infotainment system for purposes of remote authentication, or simply a serial number/version of the Infotainment software (something that is not normally accessible over the network); Activating the \"secure infotainment\" security mode (SECURITY_MUX_SECURE_INFOTAINMENT) stops the hacker from seeing real-time information.",
                    "comments": [
                    ]
                },
                {
                    "id": "HACK_INFOTAINMENT_MUSIC_CHANGE",
                    "text": "The Infotainment system plays one of a number of preset audio tracks when requested by the driver, at a volume requested by the driver; This hack forces the audio track to one that the driver did not choose and makes it impossible for the driver to change it; Activating the \"secure infotainment\" infotainment security mode (SECURITY_MUX_SECURE_INFOTAINMENT) restores control over the music.",
                    "comments": [
                    ]
                },
                {
                    "id": "ERROR_HANDLING_GENERAL",
                    "text": "If a compomemt monitored by FETT tool becomes unresponsive (the watchdog generated COMPONENT_ERROR), an error message is logged, an error message is displayed on SimPCDisplay and if the component can be reprovisioned, FETT tool starts the provisioning process; If the component cannot be provisioned (such as BeamNG), a message is displayed on SimPCDisplay, and the user is advised to restart the component manually.",
                    "comments": [
                        {
                            "text": "///////////////////////////////////"
                        },
                        {
                            "text": ""
                        },
                        {
                            "text": "END of hacks"
                        },
                        {
                            "text": ""
                        },
                        {
                            "text": "///////////////////////////////////"
                        },
                        {
                            "text": "///////////////////////////////////"
                        },
                        {
                            "text": ""
                        },
                        {
                            "text": "Errors"
                        },
                        {
                            "text": ""
                        },
                        {
                            "text": "///////////////////////////////////"
                        }
                    ]
                },
                {
                    "id": "ERROR_HANDLING_SENSOR_ERRORS",
                    "text": "If ECU SW encounters a sensor error, it displays a message on SimPCDisplay.",
                    "comments": [
                    ]
                },
                {
                    "id": "ERROR_HANDLING_SIMULATOR_PC",
                    "text": "If an error occurs in any component of Simulator PC, and it is not possible to display messages, the Simulator PC has to be manually restarted; Whole CyberPhys demonstator should be restarted to get a good known initial state.",
                    "comments": [
                    ]
                },
                {
                    "id": "ERROR_HANDLING_ADMIN_PC",
                    "text": "If there is an error on Admin PC, it has to be powered off and on again, as there is not much else that can be done.",
                    "comments": [
                        {
                            "text": "///////////////////////////////////"
                        }
                    ]
                }
            ],
            "comments": [
            ]
        }
    ],
    "relationShips": {
        "_inheritRelations": [
        ],
        "_containsRelations": [
        ],
        "_implicitContainsRelations": [
        ],
        "_clientRelations": [
        ]
    },
    "comments": [
    ]
}